app/Controllers/Dashboard.php

    public function index()
    {
        $userId = session()->get('user_id');

        $totalUndangan = $this->db->table('undangan')
            ->where('user_id', $userId)
            ->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "undangan"
WHERE "user_id" = '5'

    public function buat_undangan()
    {
        $user_id = session()->get('user_id');

        $templates = $this->templateModel->getOwnedButUnusedTemplates($user_id);

        // ── Ambil semua form_template, group by template_id → section ──
        // Struktur hasil: [ template_id => [ 'SectionName' => [ ['form_name'=>..., 'form_html'=>...], ... ], ... ], ... ]
        $formSections = $this->getFormSectionsGrouped();

        $data = [
            'title'            => 'Buat Undangan',
            'user'             => [
                'full_name' => session()->get('full_name'),
                'email'     => session()->get('email'),
                'username'  => session()->get('username'),
                'avatar'    => session()->get('avatar')
            ],
            'templates'        => $templates,
            'current_template' => $templates[0] ?? null,

            // ← BARU: dikirim ke view, di-embed ke window.DB_FORM_SECTIONS
            'formSections'     => $formSections,
        ];
---
SELECT *
FROM "template"

    public function getCustomParamKeysForTemplate(int $templateId, array $standardKeys = []): array
    {
        $rows = $this->db->table('form_template')
            ->where('template_id', $templateId)
            ->get()->getResultArray();
---
SELECT *
FROM "form_template"
WHERE "template_id" = 7

    public function getFormSectionsGrouped(): array
    {
        $rows = $this->db->table('form_template')
            ->orderBy('id', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM "form_template"
ORDER BY "id" ASC