app/Controllers/Undangan.php

SELECT *
FROM "undangan_param"
WHERE "undangan_id" = '40'
SELECT *
FROM "events"
WHERE "undangan_id" = '40'
ORDER BY "main_event" DESC, "event_date" ASC
---
    public function index($urlName = null)
    {
        if ($urlName === null) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Ambil data undangan
        $undangan = $this->undanganModel->getUndanganWithTemplate($urlName);

        if (!$undangan) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $undangan_id = $undangan['id'];
        $template_id = $undangan['template_id'];

        // ── AMBIL SEMUA PARAMS ────────────────────────────────────
        $paramsRaw = $this->db->table('undangan_param')
            ->where('undangan_id', $undangan_id)
            ->get()->getResult();

        // Ubah jadi key => value
        $params = [];
        foreach ($paramsRaw as $row) {
            $params[$row->param_name] = $row->param_value;
        }

        // ── AMBIL EVENTS ──────────────────────────────────────────
        $eventsRaw = $this->db->table('events')
            ->where('undangan_id', $undangan_id)
            ->orderBy('main_event', 'DESC')
            ->orderBy('event_date', 'ASC')
            ->get()->getResult();