app/Controllers/Undangan.php

    public function edit_undangan($urlName = null)
    {
        if ($urlName === null) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $undangan = $this->undanganModel->getUndanganWithTemplate($urlName);

        if (!$undangan) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $undangan_id = $undangan['id'];
        $template_id = $undangan['template_id'];

        // ── AMBIL PARAMS ──────────────────────────────────────────
        $params = $this->getParamsAsKV($undangan_id);

        // ── AMBIL EVENTS ──────────────────────────────────────────
        $eventsRaw = $this->db->table('events')
            ->where('undangan_id', $undangan_id)
            ->orderBy('main_event', 'DESC')
            ->orderBy('event_date', 'ASC')
            ->get()->getResult();
---
SELECT *
FROM "events"
WHERE "undangan_id" = '3'
ORDER BY "main_event" DESC, "event_date" ASC

    public function update($id = null)
    {
        $input = $this->request->getPost();

        $this->db->transStart();

        try {
            $oldUndangan = $this->undanganModel->find($id);
            if (!$oldUndangan) {
                throw new \Exception("Undangan tidak ditemukan");
            }

            $template_id = $input['template_id'] ?? $oldUndangan['template_id'];

            // ── Update tabel undangan ─────────────────────────────
            $undanganData = [];
            if (isset($input['template_id']))    $undanganData['template_id']    = $input['template_id'];
            if (isset($input['groom_name']))     $undanganData['fullname_men']   = $input['groom_name'];
            if (isset($input['groom_nickname'])) $undanganData['nickname_men']   = $input['groom_nickname'];
            if (isset($input['bride_name']))     $undanganData['fullname_women'] = $input['bride_name'];
            if (isset($input['bride_nickname'])) $undanganData['nickname_women'] = $input['bride_nickname'];
            if (isset($input['url_name']))       $undanganData['url_name']       = $input['url_name'];

            if (!empty($undanganData)) {
                $this->undanganModel->update($id, $undanganData);
---
SELECT *
FROM "undangan"
WHERE "undangan"."id" = '3'
UPDATE "undangan" SET "template_id" = '7', "fullname_men" = 'asdasd', "nickname_men" = 'sadasd', "fullname_women" = 'sadsad', "nickname_women" = 'sadsad', "url_name" = 'sadsadsad', "updated_at" = '2026-05-13 23:27:24'
WHERE "undangan"."id" IN ('3')

            // ── Upsert events ──────────────────────────────────────
            if (isset($input['acara']) && is_array($input['acara'])) {
                // Ambil event_id existing berurutan (ordered by main_event DESC, event_date ASC)
                $existingEvents = $this->db->table('events')
                    ->where('undangan_id', $id)
                    ->orderBy('main_event', 'DESC')
                    ->orderBy('event_date', 'ASC')
                    ->get()->getResultArray();
---
SELECT *
FROM "events"
WHERE "undangan_id" = '3'
ORDER BY "main_event" DESC, "event_date" ASC


                    if (isset($existingEventIds[$i])) {
                        // Update event existing
                        $this->db->table('events')
                            ->where('id', $existingEventIds[$i])
                            ->update($eventData);
---
UPDATE "events" SET "undangan_id" = '3', "event_name" = 'sadasdsad', "event_date" = '2026-05-20', "start_at" = '09:00:00', "end_at" = '11:00:00', "location" = 'sadsad', "main_event" = 1
WHERE "id" = '4'

            $keptFiles = $input['existing_gallery'] ?? [];
            if (!is_array($keptFiles)) $keptFiles = [];

            $this->db->table('undangan_param')
                ->where('undangan_id', $id)
                ->where('param_name LIKE', 'gallery_%')
                ->delete();
---
DELETE FROM "undangan_param"
WHERE "undangan_id" = '3'
AND "param_name" LIKE 'gallery_%'

            $galleryIndex = 0;
            foreach ($keptFiles as $filePath) {
                if (!empty($filePath)) {
                    $this->db->table('undangan_param')->insert([
                        'undangan_id' => $id,
                        'param_name'  => "gallery_{$galleryIndex}",
                        'param_value' => $filePath,
                    ]);
---
INSERT INTO "undangan_param" ("undangan_id", "param_name", "param_value") VALUES ('3', 'gallery_0', 'assets/gallery/3/gallery_6a04a2d1c7b67.png')

            }

            // ── Gift: delete-insert ────────────────────────────────
            $this->db->table('undangan_param')
                ->where('undangan_id', $id)
                ->where('param_name LIKE', 'gift_%')
                ->delete();
---
DELETE FROM "undangan_param"
WHERE "undangan_id" = '3'
AND "param_name" LIKE 'gift_%'

            if (isset($input['gift']) && is_array($input['gift'])) {
                foreach ($input['gift'] as $i => $gift) {
                    $type = $gift['type'] ?? 'rekening';
                    $this->db->table('undangan_param')->insert([
                        'undangan_id' => $id,
                        'param_name'  => "gift_{$i}_type",
                        'param_value' => $type,
                    ]);
                    if ($type === 'rekening') {
                        foreach (['rekening_nama', 'rekening_bank', 'rekening_nomor'] as $f) {
                            if (!empty($gift[$f])) {
                                $this->db->table('undangan_param')->insert([
                                    'undangan_id' => $id,
                                    'param_name'  => "gift_{$i}_{$f}",
                                    'param_value' => $gift[$f],
                                ]);
---
INSERT INTO "undangan_param" ("undangan_id", "param_name", "param_value") VALUES ('3', 'gift_0_type', 'rekening')
INSERT INTO "undangan_param" ("undangan_id", "param_name", "param_value") VALUES ('3', 'gift_0_rekening_nama', 'asdadsa')

                    } else {
                        foreach (['alamat_nama', 'alamat_detail'] as $f) {
                            if (!empty($gift[$f])) {
                                $this->db->table('undangan_param')->insert([
                                    'undangan_id' => $id,
                                    'param_name'  => "gift_{$i}_{$f}",
                                    'param_value' => $gift[$f],
                                ]);
---
INSERT INTO "undangan_param" ("undangan_id", "param_name", "param_value") VALUES ('3', 'gift_1_alamat_nama', 'asdasd')

    private function getParamsAsKV(int $undangan_id): array
    {
        $paramsRaw = $this->db->table('undangan_param')
            ->where('undangan_id', $undangan_id)
            ->get()->getResult();
---
SELECT *
FROM "undangan_param"
WHERE "undangan_id" = 3

    private function getCustomParamsForTemplate(int $templateId, array $params): array
    {
        $standardKeys = [
            'judul_undangan', 'keterangan',
            'groom_father', 'groom_mother',
            'bride_father', 'bride_mother',
            'quote_text', 'love_story', 'music_choice',
            // Field tabel undangan — sudah ada di $data utama
            'groom_name', 'bride_name', 'groom_nickname', 'bride_nickname',
            'url_name', 'template_id',
        ];

        $rows = $this->db->table('form_template')
            ->where('template_id', $templateId)
            ->get()->getResultArray();
---
SELECT *
FROM "form_template"
WHERE "template_id" = 7

    private function upsertParams(int $undangan_id, array $params): void
    {
        if (empty($params)) return;

        // Ambil semua param_name existing untuk undangan ini (1 query)
        $existingKeys = $this->db->table('undangan_param')
            ->select('param_name')
            ->where('undangan_id', $undangan_id)
            ->get()->getResultArray();

        $existingKeySet = array_flip(array_column($existingKeys, 'param_name'));

        foreach ($params as $name => $value) {
            $isEmpty = ($value === null || $value === '');

            if (isset($existingKeySet[$name])) {
                if ($isEmpty) {
                    // Value dikosongkan → hapus param
                    $this->db->table('undangan_param')
                        ->where('undangan_id', $undangan_id)
                        ->where('param_name', $name)
                        ->delete();
                } else {
                    // Update value existing
                    $this->db->table('undangan_param')
                        ->where('undangan_id', $undangan_id)
                        ->where('param_name', $name)
                        ->update(['param_value' => $value]);
---
SELECT "param_name"
FROM "undangan_param"
WHERE "undangan_id" = 3
UPDATE "undangan_param" SET "param_value" = 'sadsadsad'
WHERE "undangan_id" = 3
AND "param_name" = 'judul_undangan'