app/Models/GuestModel.php

SELECT COUNT(*) AS "numrows"
FROM "guest" "g"
JOIN "undangan" "u" ON "u"."id" = "g"."undangan_id"
WHERE "g"."undangan_id" = '3'
SELECT "g".*, "u"."url_name", "u"."fullname_men", "u"."fullname_women"
FROM "guest" "g"
JOIN "undangan" "u" ON "u"."id" = "g"."undangan_id"
WHERE "g"."undangan_id" = '3'
ORDER BY "g"."id" DESC
 LIMIT 6
---
    public function getGuestsByUndanganId($undanganId, $search = '', $rsvpFilter = null, $limit = 6, $offset = 0)
    {
        $builder = $this->db->table('guest g')
            ->select('g.*, u.url_name, u.fullname_men, u.fullname_women')
            ->join('undangan u', 'u.id = g.undangan_id')
            ->where('g.undangan_id', $undanganId);

        if (!empty($search)) {
            $builder->like('g.guest_name', $search);
        }

        if ($rsvpFilter !== null && $rsvpFilter !== 'all') {
            $builder->where('g.rsvp', (int)$rsvpFilter);
        }

        $total = $builder->countAllResults(false);

        $guests = $builder->orderBy('g.id', 'DESC')
            ->limit($limit, $offset)
            ->get()
            ->getResult(); // <- array of objects

SELECT "event_name"
FROM "events"
WHERE "id" IN ('4')
---
    public function getGuestEvents($eventsId)
    {
        if (empty($eventsId)) {
            return [];
        }

        // Handle PostgreSQL array format {1,2,3}
        if (is_string($eventsId)) {
            $eventsId = trim($eventsId, '{}');
            $eventsId = $eventsId ? explode(',', $eventsId) : [];
        } elseif (!is_array($eventsId)) {
            $eventsId = (array) $eventsId;
        }

        if (empty($eventsId)) {
            return [];
        }

        $events = $this->db->table('events')
            ->select('event_name')
            ->whereIn('id', $eventsId)
            ->get()
            ->getResult();

SELECT COUNT(*) AS "numrows"
FROM "guest"
WHERE "undangan_id" = '3'
SELECT COUNT(*) AS "numrows"
FROM "guest"
WHERE "undangan_id" = '3'
AND "undangan_id" = '3'
AND "rsvp" = 1
SELECT COUNT(*) AS "numrows"
FROM "guest"
WHERE "undangan_id" = '3'
AND "undangan_id" = '3'
AND "rsvp" = 1
AND "undangan_id" = '3'
AND "rsvp" = 0
SELECT COUNT(*) AS "numrows"
FROM "guest"
WHERE "undangan_id" = '3'
AND "undangan_id" = '3'
AND "rsvp" = 1
AND "undangan_id" = '3'
AND "rsvp" = 0
AND "undangan_id" = '3'
AND "rsvp" = 2
SELECT COUNT(*) AS "numrows"
FROM "guest"
WHERE "undangan_id" = '3'
AND "undangan_id" = '3'
AND "rsvp" = 1
AND "undangan_id" = '3'
AND "rsvp" = 0
AND "undangan_id" = '3'
AND "rsvp" = 2
AND "undangan_id" = '3'
AND "rsvp" = 3
---
    public function getStatistics($undanganId)
    {
        $total = $this->where('undangan_id', $undanganId)->countAllResults(false);

        $hadir = $this->where('undangan_id', $undanganId)
            ->where('rsvp', self::RSVP_HADIR)
            ->countAllResults(false);

        $belum = $this->where('undangan_id', $undanganId)
            ->where('rsvp', self::RSVP_BELUM)
            ->countAllResults(false);

        $tidak = $this->where('undangan_id', $undanganId)
            ->where('rsvp', self::RSVP_TIDAK_HADIR)
            ->countAllResults(false);

        $mungkin = $this->where('undangan_id', $undanganId)
            ->where('rsvp', self::RSVP_MUNGKIN)
            ->countAllResults(false);