app/Models/UndanganModel.php

SELECT "undangan".*, "template"."file_path"
FROM "undangan"
JOIN "template" ON "template"."id" = "undangan"."template_id"
WHERE "undangan"."url_name" = 'adam-aul'
 LIMIT 1
---
    public function getUndanganWithTemplate($urlName)
    {
        return $this->select('undangan.*, template.file_path')
                    ->join('template', 'template.id = undangan.template_id')
                    ->where('undangan.url_name', $urlName)
                    ->first();