app/Models/UndanganModel.php

    public function getByUrlName($urlName)
    {
        $result = $this->where('url_name', $urlName)->first();
---
SELECT *
FROM "undangan"
WHERE "url_name" = 'sadsadsad'
 LIMIT 1

    public function getUndanganWithTemplate($urlName)
    {
        $result = $this->db->table('undangan u')
            ->select('u.*, t.template_name, t.file_path, t.category, t.price')
            ->join('template t', 't.id = u.template_id', 'left')
            ->where('u.url_name', $urlName)
            ->get()
            ->getRowArray(); // ← Change to getRowArray()
---
SELECT "u".*, "t"."template_name", "t"."file_path", "t"."category", "t"."price"
FROM "undangan" "u"
LEFT JOIN "template" "t" ON "t"."id" = "u"."template_id"
WHERE "u"."url_name" = 'sadsadsad'

    public function getMainEvent($undanganId)
    {
        $result = $this->db->table('events')
            ->where('undangan_id', $undanganId)
            ->where('main_event', 1)
            ->get()
            ->getRow(); // <- getRow() mengembalikan object
---
SELECT *
FROM "events"
WHERE "undangan_id" = '3'
AND "main_event" = 1

    public function getEvents($undanganId)
    {
        return $this->db->table('events')
            ->where('undangan_id', $undanganId)
            ->orderBy('main_event', 'DESC')
            ->orderBy('event_date', 'ASC')
            ->get()
            ->getResult(); // <- getResult() mengembalikan array of objects
---
SELECT *
FROM "events"
WHERE "undangan_id" = '3'
ORDER BY "main_event" DESC, "event_date" ASC